InformationRegisters/ПЛ_СоответствиеСФронтСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПЛ_СоответствиеСФронтСистемами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПЛ_ТипыОбъектовФронтСистем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВлияетНаУчетТМЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПЛ_ТипыОбъектовФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФронтСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ТипыФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/питУчетДанныхПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питУчетДанныхПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассовыйУзел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.питУдаленныеКассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.питДанныеПродажФронта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбновленПриемник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/MRS_ПомощникЗакрытияСменыСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Сопоставляет объект фронт-системы (кассу или номенклатуру) с объектом 1С.
// Создаёт запись в регистре ПЛ_СоответствиеСФронтСистемами, если её ещё нет.
//
// Параметры:
//  ТипОбъекта     - ПланВидовХарактеристикСсылка.ПЛ_ТипыОбъектовФронтСистем - тип сопоставляемого объекта
//  ФронтСистема   - ПеречислениеСсылка.ПЛ_ТипыФронтСистем - фронт-система
//  Код            - Строка - код объекта во фронт-системе
//  Объект         - Произвольный - сопоставленный объект 1С
//                   (СправочникСсылка.КассыККМ или СправочникСсылка.Номенклатура)
//
// Возвращаемое значение:
//  Булево - Истина, если запись успешно создана или обновлена
//
Функция СопоставитьОбъектФронта(ТипОбъекта, ФронтСистема, Код, Объект) Экспорт

	НаборЗаписей = РегистрыСведений.ПЛ_СоответствиеСФронтСистемами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТипОбъекта.Установить(ТипОбъекта);
	НаборЗаписей.Отбор.ФронтСистема.Установить(ФронтСистема);
	НаборЗаписей.Отбор.Код.Установить(Код);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ТипОбъекта = ТипОбъекта;
		НоваяЗапись.ФронтСистема = ФронтСистема;
		НоваяЗапись.Код = Код;
	Иначе
		НоваяЗапись = НаборЗаписей[0];
	КонецЕсли;

	НоваяЗапись.Объект = Объект;
	НаборЗаписей.Записать();

	Возврат Истина;

КонецФункции

// Вычисляет статус шага «Сопоставление объектов фронта» для выбранного дня и складов.
// Возвращает структуру с полным состоянием шага для отображения в форме.
//
// Параметры:
//  День           - Дата - выбранный день
//  МассивСкладов  - Массив из СправочникСсылка.Склады - выбранные склады
//
// Возвращаемое значение:
//  Структура:
//   - Статус       - Строка - «Пройден» / «НеПройден»
//   - Строки       - ТаблицаЗначений - строки несопоставленных объектов
//       колонки: ТипОбъекта, ФронтСистема, Код, НаименованиеНаФронте
//
Функция СтатусШагаСопоставление(День, МассивСкладов) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Статус", "Пройден");
	Результат.Вставить("Строки", Новый ТаблицаЗначений);

	ТаблицаНесопоставленных = Результат.Строки;
	ТаблицаНесопоставленных.Колонки.Добавить("ТипОбъекта");
	ТаблицаНесопоставленных.Колонки.Добавить("ФронтСистема");
	ТаблицаНесопоставленных.Колонки.Добавить("Код");
	ТаблицаНесопоставленных.Колонки.Добавить("НаименованиеНаФронте");

	НачалоДня = НачалоДня(День);
	КонецДня  = КонецДня(День);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Соответствие.ТипОбъекта      КАК ТипОбъекта,
	|	Соответствие.ФронтСистема    КАК ФронтСистема,
	|	Соответствие.Код             КАК Код,
	|	Соответствие.НаименованиеКнопки КАК НаименованиеНаФронте
	|ИЗ
	|	РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК Соответствие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питДанныеПродажФронта КАК Чек
	|		ПО (Соответствие.ТипОбъекта = &ТипКасса
	|				И Соответствие.Код = Чек.ПЛ_КодТочкиПродажи)
	|			ИЛИ (Соответствие.ТипОбъекта = &ТипНоменклатура
	|				И Соответствие.Код = Чек.ПЛ_КодКнопки)
	|ГДЕ
	|	Соответствие.Объект = ЗНАЧЕНИЕ(ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.ПустаяСсылка)
	|	И Чек.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И Чек.Склад В (&МассивСкладов)
	|	И НЕ Чек.ПометкаУдаления";

	Запрос.УстановитьПараметр("ТипКасса",        ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.КассаККМ);
	Запрос.УстановитьПараметр("ТипНоменклатура", ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.Номенклатура);
	Запрос.УстановитьПараметр("НачалоДня",       НачалоДня);
	Запрос.УстановитьПараметр("КонецДня",        КонецДня);
	Запрос.УстановитьПараметр("МассивСкладов",   МассивСкладов);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаНесопоставленных.Добавить();
		НоваяСтрока.ТипОбъекта          = Выборка.ТипОбъекта;
		НоваяСтрока.ФронтСистема        = Выборка.ФронтСистема;
		НоваяСтрока.Код                 = Выборка.Код;
		НоваяСтрока.НаименованиеНаФронте = Выборка.НаименованиеНаФронте;
	КонецЦикла;

	Если ТаблицаНесопоставленных.Количество() > 0 Тогда
		Результат.Статус = "НеПройден";
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Вычисляет статус шага «Сверка чеков» для выбранного дня и складов.
// Возвращает структуру с полным состоянием шага.
//
// Параметры:
//  День           - Дата - выбранный день
//  МассивСкладов  - Массив из СправочникСсылка.Склады - выбранные склады
//
// Возвращаемое значение:
//  Структура:
//   - Статус       - Строка - «Пройден» / «НеПройден» / «НетДанных»
//   - Строки       - ТаблицаЗначений - строки отклонений
//
Функция СтатусШагаСверка(День, МассивСкладов) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Статус", "Пройден");
	Результат.Вставить("Строки", Новый ТаблицаЗначений);

	// Проверяем наличие документов за день
	НачалоДня = НачалоДня(День);
	КонецДня  = КонецДня(День);

	ЗапросНаличияЧеков = Новый Запрос;
	ЗапросНаличияЧеков.Текст =
	"ВЫБРАТЬ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Чек.Ссылка) КАК КоличествоЧеков
	|ИЗ
	|	Документ.питДанныеПродажФронта КАК Чек
	|ГДЕ
	|	Чек.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И Чек.Склад В (&МассивСкладов)
	|	И НЕ Чек.ПометкаУдаления";

	ЗапросНаличияЧеков.УстановитьПараметр("НачалоДня",     НачалоДня);
	ЗапросНаличияЧеков.УстановитьПараметр("КонецДня",      КонецДня);
	ЗапросНаличияЧеков.УстановитьПараметр("МассивСкладов", МассивСкладов);

	ВыборкаНаличияЧеков = ЗапросНаличияЧеков.Выполнить().Выбрать();
	ВыборкаНаличияЧеков.Следующий();

	Если ВыборкаНаличияЧеков.КоличествоЧеков = 0 Тогда
		Результат.Статус = "НетДанных";
		Возврат Результат;
	КонецЕсли;

	// Получаем отклонения и заполняем таблицу
	ТаблицаОтклонений = ПолучитьОтклоненияСверки(День, МассивСкладов);

	Если ТаблицаОтклонений.Количество() > 0 Тогда
		Результат.Статус = "НеПройден";
	КонецЕсли;

	Результат.Строки = ТаблицаОтклонений;

	Возврат Результат;

КонецФункции

// Запускает (пере)загрузку чеков за выбранный день по обеим фронт-системам.
// Вызывается точечным действием на шагах «Сопоставление» и «Сверка».
//
// Параметры:
//  День - Дата - день, за который требуется перезагрузить чеки
//
Процедура ПерезагрузитьЧекиЗаДень(День) Экспорт

	НачалоДня = НачалоДня(День);
	КонецДня  = КонецДня(День);

	// TNG
	Попытка
		MRS_МенеджерОбменаTNG.ВыполнитьЗагрузкуДанныхTNG(
			Перечисления.ПЛ_ТипыФронтСистем.TNG,
			НачалоДня,
			КонецДня,
			Неопределено,
			Неопределено);
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'MRS.ПомощникЗакрытияСмены.ПерезагрузкаЧеков.ОшибкаTNG'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	// Micros
	Попытка
		MRS_МенеджерОбменаMicros.ВыполнитьЗагрузкуДанныхMicros(
			Перечисления.ПЛ_ТипыФронтСистем.Micros,
			НачалоДня,
			КонецДня,
			Неопределено,
			Неопределено);
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'MRS.ПомощникЗакрытияСмены.ПерезагрузкаЧеков.ОшибкаMicros'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Проверяет наличие неактуальных записей в регистре питУчетДанныхПродаж
// для выбранного дня и склада.
//
// Параметры:
//  День   - Дата
//  Склад  - СправочникСсылка.Склады
//
// Возвращаемое значение:
//  Булево - Истина, если есть записи с ОбновленПриемник = Ложь
//
Функция ЕстьНеактуальныеВыпуски(День, Склад) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетДанныхПродаж.ДокументРегистратор КАК Документ
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК УчетДанныхПродаж
	|ГДЕ
	|	УчетДанныхПродаж.Дата = &ВыбранныйДень
	|	И УчетДанныхПродаж.КассовыйУзел.СкладПриготовления = &Склад
	|	И НЕ УчетДанныхПродаж.ОбновленПриемник";

	Запрос.УстановитьПараметр("ВыбранныйДень", День);
	Запрос.УстановитьПараметр("Склад",         Склад);

	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка.Следующий();

КонецФункции

// Формирует целевые документы (питВыпускБлюд) для выбранного дня и склада.
// Выполняет полный цикл: пометка чеков к пересозданию → заполнение параметров
// обработки → запуск ВыполнитьЗагрузкуДанных().
//
// Параметры:
//  День            - Дата
//  Склад           - СправочникСсылка.Склады
//  АдресРезультата - Строка - адрес во временном хранилище для размещения результата
//
Процедура СформироватьЦелевыеДокументы(День, Склад, АдресРезультата) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ДокументВыпуска", Неопределено);
	Результат.Вставить("СообщенияОбОшибках", "");
	Результат.Вставить("Успешно", Ложь);

	Попытка
		// Шаг 1: пометить чеки к пересозданию
		ПометитьЧекиКПересозданию(День, Склад);

		// Шаг 2: создать и заполнить обработку
		ОбработкаОбъект = Обработки.питЗагрузкаИзДанныхПродажФронта.Создать();
		ЗаполнитьПараметрыЗагрузкиОбработки(ОбработкаОбъект, День, Склад);

		// Шаг 3: запустить формирование
		ОбработкаОбъект.ВыполнитьЗагрузкуДанных();

		// Собрать результат
		Результат.ДокументВыпуска = ОбработкаОбъект.Ссылка;
		Результат.СообщенияОбОшибках = ПолучитьСообщенияПользователю(Истина);
		Результат.Успешно = Истина;

	Исключение
		Результат.СообщенияОбОшибках = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'MRS.ПомощникЗакрытияСмены.ФормированиеДокументов.Ошибка'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			Результат.СообщенияОбОшибках);
	КонецПопытки;

	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);

КонецПроцедуры

// Вычисляет статус шага «Формирование целевых документов» для выбранного дня и склада.
// Проверяет: полноту загрузки, актуальность выпусков, отклонения сверки чеков/выпусков,
// ошибки формирования, документы открытых цен.
//
// Параметры:
//  День   - Дата
//  Склад  - СправочникСсылка.Склады
//
// Возвращаемое значение:
//  Структура:
//   - Статус                 - Строка - «Пройден» / «НеПройден»
//   - ЗагрузкаНеПолная        - Булево
//   - НуженДиалогАктуальности - Булево
//   - ОтклоненияВыпуска       - ТаблицаЗначений
//   - ОшибкиФормирования      - ТаблицаЗначений
//   - ДокументыОткрытыеЦены   - ТаблицаЗначений
//
Функция СтатусШагаФормирование(День, Склад) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Статус",                  "Пройден");
	Результат.Вставить("ЗагрузкаНеПолная",        Ложь);
	Результат.Вставить("НуженДиалогАктуальности", Ложь);
	Результат.Вставить("ОтклоненияВыпуска",       Новый ТаблицаЗначений);
	Результат.Вставить("ОшибкиФормирования",      Новый ТаблицаЗначений);
	Результат.Вставить("ДокументыОткрытыеЦены",   Новый ТаблицаЗначений);

	// 1. Предусловие: полнота загрузки чеков
	Если НЕ ЧекиЗагруженыПолностью(День, Склад) Тогда
		Результат.Статус           = "НеПройден";
		Результат.ЗагрузкаНеПолная = Истина;
		Возврат Результат;
	КонецЕсли;

	// 2. Проверка актуальности выпусков
	Если ЕстьНеактуальныеВыпуски(День, Склад) Тогда
		Результат.НуженДиалогАктуальности = Истина;
	КонецЕсли;

	// 3. Сверка чеков и выпусков
	ТаблицаОтклоненийВыпуска = ПолучитьОтклоненияВыпуска(День, Склад);
	Результат.ОтклоненияВыпуска = ТаблицаОтклоненийВыпуска;

	// Проверяем блокирующие строки (отрицательные отклонения)
	Для Каждого Строка Из ТаблицаОтклоненийВыпуска Цикл
		Если Строка.Разница < 0 Тогда
			Результат.Статус = "НеПройден";
			Прервать;
		КонецЕсли;
	КонецЦикла;

	// 4. Ошибки формирования
	Результат.ОшибкиФормирования = ПолучитьОшибкиФормирования(День, Склад);
	Если Результат.ОшибкиФормирования.Количество() > 0 Тогда
		Результат.Статус = "НеПройден";
	КонецЕсли;

	// 5. Документы открытых цен (непроведённые)
	Результат.ДокументыОткрытыеЦены = ПолучитьДокументыОткрытыеЦены(День, Склад);
	Если Результат.ДокументыОткрытыеЦены.Количество() > 0 Тогда
		Результат.Статус = "НеПройден";
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Вычисляет статус шага «Анализ отрицательных остатков» для выбранного дня и склада.
//
// Параметры:
//  День   - Дата
//  Склад  - СправочникСсылка.Склады
//
// Возвращаемое значение:
//  Структура:
//   - Статус  - Строка - «Пройден» / «НеПройден»
//   - Строки  - ТаблицаЗначений - строки отрицательных остатков
//
Функция СтатусШагаОстатки(День, Склад) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Статус", "Пройден");
	Результат.Вставить("Строки", Новый ТаблицаЗначений);

	ТаблицаОстатков = ПолучитьОтрицательныеОстатки(День, Склад);

	Если ТаблицаОстатков.Количество() > 0 Тогда
		Результат.Статус = "НеПройден";
	КонецЕсли;

	Результат.Строки = ТаблицаОстатков;

	Возврат Результат;

КонецФункции

// Вычисляет рекомендуемый день для начала работы мастера -
// самый ранний день с хотя бы одним непройденным шагом.
//
// Параметры:
//  МассивСкладов - Массив из СправочникСсылка.Склады
//
// Возвращаемое значение:
//  Дата - рекомендуемый день, либо Дата(1,1,1), если все дни закрыты
//
Функция РекомендуемыйДень(МассивСкладов) Экспорт

	СекундВСутках = 86400;

	// Определяем границу: от максимальной даты запрета до вчерашнего дня
	МаксДатаЗапрета = Дата(1, 1, 1);

	ЗапросМаксимальнойДатыЗапрета = Новый Запрос;
	ЗапросМаксимальнойДатыЗапрета.Текст =
	"ВЫБРАТЬ МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапрета) КАК МаксДата
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения";

	ВыборкаДатЗапрета = ЗапросМаксимальнойДатыЗапрета.Выполнить().Выбрать();
	Если ВыборкаДатЗапрета.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДатЗапрета.МаксДата) Тогда
			МаксДатаЗапрета = ВыборкаДатЗапрета.МаксДата;
		КонецЕсли;
	КонецЕсли;

	ДатаНачала = МаксДатаЗапрета;
	ДатаКонца  = ТекущаяДатаСеанса() - СекундВСутках; // вчера

	Если ДатаНачала > ДатаКонца Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;

	// Пакетный запрос по диапазону дат - ищем самый ранний день с непройденными шагами
	// Упрощённо: перебираем даты от начала к концу и проверяем каждый день
	// (полноценный пакетный запрос требует сложного объединения по всем доменам)
	ТекущаяДата = ДатаНачала;

	Пока ТекущаяДата <= ДатаКонца Цикл
		// Проверяем шаг «Сопоставление» - самый ранний индикатор
		СтатусСопоставление = СтатусШагаСопоставление(ТекущаяДата, МассивСкладов);

		Если СтатусСопоставление.Статус = "НеПройден" Тогда
			Возврат ТекущаяДата;
		КонецЕсли;

		// Проверяем шаг «Сверка»
		СтатусСверка = СтатусШагаСверка(ТекущаяДата, МассивСкладов);

		Если СтатусСверка.Статус <> "Пройден" Тогда
			Возврат ТекущаяДата;
		КонецЕсли;

		// Проверяем шаги «Формирование» и «Остатки» по каждому складу
		Для Каждого Склад Из МассивСкладов Цикл
			СтатусФормирование = СтатусШагаФормирование(ТекущаяДата, Склад);

			Если СтатусФормирование.Статус <> "Пройден" Тогда
				Возврат ТекущаяДата;
			КонецЕсли;

			СтатусОстатки = СтатусШагаОстатки(ТекущаяДата, Склад);

			Если СтатусОстатки.Статус <> "Пройден" Тогда
				Возврат ТекущаяДата;
			КонецЕсли;
		КонецЦикла;

		ТекущаяДата = ТекущаяДата + СекундВСутках;
	КонецЦикла;

	Возврат Дата(1, 1, 1); // все дни закрыты

КонецФункции

// Вычисляет статус шага помощника в фоне и помещает результат во временное хранилище.
//
// Параметры:
//  ПараметрыСтатуса - Структура:
//   * ТекущаяСтраница - Строка
//   * ВыбранныйДень   - Дата
//   * МассивСкладов   - Массив из СправочникСсылка.Склады
//   * ТекущийСклад    - СправочникСсылка.Склады
//   * ПараметрыКасс   - ТаблицаЗначений
//  АдресРезультата - Строка - адрес во временном хранилище
//
Процедура СтатусШагаВФоне(ПараметрыСтатуса, АдресРезультата) Экспорт

	ТекущаяСтраница = ПараметрыСтатуса.ТекущаяСтраница;
	День            = ПараметрыСтатуса.ВыбранныйДень;
	МассивСкладов   = ПараметрыСтатуса.МассивСкладов;
	ТекущийСклад    = ПараметрыСтатуса.ТекущийСклад;
	ПараметрыКасс   = ПараметрыСтатуса.ПараметрыКасс;

	Если НЕ ЗначениеЗаполнено(ТекущийСклад) И МассивСкладов.Количество() > 0 Тогда
		ТекущийСклад = МассивСкладов[0];
	КонецЕсли;

	РезультатФона = Новый Структура;
	РезультатФона.Вставить("ТекущаяСтраница", ТекущаяСтраница);
	РезультатФона.Вставить("Результат", Неопределено);
	РезультатФона.Вставить("ОбщийСтатус", "");

	Если ТекущаяСтраница = "СтраницаСопоставления" Тогда

		РезультатФона.Результат = СтатусШагаСопоставление(День, МассивСкладов);
		РезультатФона.ОбщийСтатус = РезультатФона.Результат.Статус;

	ИначеЕсли ТекущаяСтраница = "СтраницаСверка" Тогда

		РезультатФона.Результат = СтатусШагаСверка(День, МассивСкладов, ПараметрыКасс);
		РезультатФона.ОбщийСтатус = РезультатФона.Результат.Статус;

	ИначеЕсли ТекущаяСтраница = "СтраницаФормирование" Тогда

		РезультатФона.Результат = СтатусШагаФормирование(День, ТекущийСклад, ПараметрыКасс);
		РезультатФона.ОбщийСтатус = ОбщийСтатусФормирования(День, МассивСкладов, ПараметрыКасс);

	ИначеЕсли ТекущаяСтраница = "СтраницаОстатки" Тогда

		РезультатФона.Результат = СтатусШагаОстатки(День, ТекущийСклад);
		РезультатФона.ОбщийСтатус = ОбщийСтатусОстатков(День, МассивСкладов);

	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатФона, АдресРезультата);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует построчную таблицу отклонений сверки чеков между данными фронта и 1С.
// Вызывает live-запросы к Oracle через MRS_МенеджерОбменаTNG/Micros.
//
// Параметры:
//  День           - Дата
//  МассивСкладов  - Массив из СправочникСсылка.Склады
//
// Возвращаемое значение:
//  ТаблицаЗначений с колонками:
//   - ФронтСистема, НомерЧека, КодТочкиПродаж, Номенклатура,
//   - СуммаПоФронту, СуммаПоЧеку1С, ОтклонениеСуммы,
//   - СкидкаПоФронту, СкидкаПоЧеку1С, ОтклонениеСкидки,
//   - КатегорияОтклонения (Строка: «Сумма», «Скидка», «АлкогольМарка», «СуммаИСкидка»)
//
Функция ПолучитьОтклоненияСверки(День, МассивСкладов) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ФронтСистема");
	Результат.Колонки.Добавить("НомерЧека");
	Результат.Колонки.Добавить("КодТочкиПродаж");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("СуммаПоФронту");
	Результат.Колонки.Добавить("СуммаПоЧеку1С");
	Результат.Колонки.Добавить("ОтклонениеСуммы");
	Результат.Колонки.Добавить("СкидкаПоФронту");
	Результат.Колонки.Добавить("СкидкаПоЧеку1С");
	Результат.Колонки.Добавить("ОтклонениеСкидки");
	Результат.Колонки.Добавить("КатегорияОтклонения");

	НачалоДня = НачалоДня(День);
	КонецДня  = КонецДня(День);

	// Обработка TNG
	Попытка
		ТаблицаTNG = MRS_МенеджерОбменаTNG.ВыполнитьПолучениеДанныхTNG(
			Перечисления.ПЛ_ТипыФронтСистем.TNG,
			НачалоДня,
			КонецДня,
			Неопределено,
			Неопределено);

		Если ТаблицаTNG <> Неопределено Тогда
			ОбработатьСтрокиСверки(Результат, ТаблицаTNG, "TNG");
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'MRS.ПомощникЗакрытияСмены.Сверка.ОшибкаTNG'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	// Обработка Micros
	Попытка
		ТаблицаMicros = MRS_МенеджерОбменаMicros.ВыполнитьПолучениеДанныхMicros(
			Перечисления.ПЛ_ТипыФронтСистем.Micros,
			НачалоДня,
			КонецДня,
			Неопределено,
			Неопределено);

		Если ТаблицаMicros <> Неопределено Тогда
			ОбработатьСтрокиСверки(Результат, ТаблицаMicros, "Micros");
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'MRS.ПомощникЗакрытияСмены.Сверка.ОшибкаMicros'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Проверяет, загружены ли все чеки за день для указанного склада.
// Сравнивает множество номеров чеков фронта с загруженными в 1С.
//
// Параметры:
//  День   - Дата
//  Склад  - СправочникСсылка.Склады
//
// Возвращаемое значение:
//  Булево - Истина, если все чеки фронта присутствуют среди загруженных
//
Функция ЧекиЗагруженыПолностью(День, Склад) Экспорт

	НачалоДня = НачалоДня(День);
	КонецДня  = КонецДня(День);
	ПараметрыКассMicros = ПараметрыКассДляФронтСистемы(
		ПараметрыКасс,
		Перечисления.ПЛ_ТипыФронтСистем.Micros);

	// Собираем номера чеков из загруженных документов
	ЗапросЗагруженныхЧеков = Новый Запрос;
	ЗапросЗагруженныхЧеков.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Чек.НомерЧека КАК НомерЧека
	|ИЗ
	|	Документ.питДанныеПродажФронта КАК Чек
	|ГДЕ
	|	Чек.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И Чек.Склад = &Склад
	|	И НЕ Чек.ПометкаУдаления";

	ЗапросЗагруженныхЧеков.УстановитьПараметр("НачалоДня", НачалоДня);
	ЗапросЗагруженныхЧеков.УстановитьПараметр("КонецДня",  КонецДня);
	ЗапросЗагруженныхЧеков.УстановитьПараметр("Склад",     Склад);

	ВыборкаЗагруженныхЧеков = ЗапросЗагруженныхЧеков.Выполнить().Выбрать();

	НомераЗагруженныхЧеков = Новый Соответствие;
	Пока ВыборкаЗагруженныхЧеков.Следующий() Цикл
		НомераЗагруженныхЧеков.Вставить(ВыборкаЗагруженныхЧеков.НомерЧека, Истина);
	КонецЦикла;

	Если НомераЗагруженныхЧеков.Количество() = 0 Тогда
		Возврат Ложь; // нет загруженных чеков вообще
	КонецЕсли;

	// Получаем данные фронта и сравниваем номера чеков
	Попытка
		ТаблицаФронта = MRS_МенеджерОбменаTNG.ВыполнитьПолучениеДанныхTNG(
			Перечисления.ПЛ_ТипыФронтСистем.TNG,
			НачалоДня,
			КонецДня,
			Неопределено,
			Неопределено);

		Если ТаблицаФронта <> Неопределено Тогда
			Для Каждого СтрокаФронта Из ТаблицаФронта Цикл
				НомерЧека = СтрокаФронта.НомерЧека;
				Если ЗначениеЗаполнено(НомерЧека) Тогда
					Если НомераЗагруженныхЧеков.Получить(НомерЧека) = Неопределено Тогда
						Возврат Ложь; // чек фронта отсутствует в загруженных
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Исключение
		// Если не удалось получить данные фронта - считаем загрузку условно полной
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'MRS.ПомощникЗакрытияСмены.ПолнотаЗагрузки.Ошибка'"),
			УровеньЖурналаРегистрации.Предупреждение,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Истина;

КонецФункции

// Помечает чеки к пересозданию приёмника - эквивалент паттерна
// УстановитьВозможностьЗагрузкиНаСервере из Forms/ВозможностьЗагрузкиДПФ.
// Выполняет Записать() для документов питДанныеПродажФронта,
// у которых ОбновленПриемник ≠ Истина в указанных день+склад.
//
// Параметры:
//  День   - Дата
//  Склад  - СправочникСсылка.Склады
//
Процедура ПометитьЧекиКПересозданию(День, Склад) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчетДанныхПродаж.ДокументРегистратор КАК Документ
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК УчетДанныхПродаж
	|ГДЕ
	|	УчетДанныхПродаж.Дата = &День
	|	И УчетДанныхПродаж.КассовыйУзел.СкладПриготовления = &Склад
	|	И НЕ УчетДанныхПродаж.ОбновленПриемник

	|ОБЪЕДИНИТЬ

	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчетДанныхПродаж.ДокументРегистратор
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК УчетДанныхПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.питДанныеПродажФронта КАК Чек
	|		ПО УчетДанныхПродаж.ДокументРегистратор = Чек.Ссылка
	|ГДЕ
	|	УчетДанныхПродаж.Дата = &День
	|	И УчетДанныхПродаж.КассовыйУзел.СкладПриготовления = &Склад
	|	И НЕ УчетДанныхПродаж.ОбновленПриемник
	|	И Чек.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПитДанныеПродажФронта.ДанныеПродажФронтаВозврат)";

	Запрос.УстановитьПараметр("День",  День);
	Запрос.УстановитьПараметр("Склад", Склад);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		// Паттерн из УстановитьВозможностьЗагрузкиНаСервере (ВозможностьЗагрузкиДПФ):
		// запись одиночных документов в цикле с индивидуальной обработкой ошибок
		Попытка
			ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
			ДокументОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'MRS.ПомощникЗакрытияСмены.ПометкаЧеков.Ошибка'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Выборка.Документ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

// Заполняет реквизиты обработки питЗагрузкаИзДанныхПродажФронта
// значениями по умолчанию и ограничивает отбор выбранным днём и складом.
//
// Параметры:
//  Обработка - ОбработкаОбъект.питЗагрузкаИзДанныхПродажФронта
//  День      - Дата
//  Склад     - СправочникСсылка.Склады
//
Процедура ЗаполнитьПараметрыЗагрузкиОбработки(Обработка, День, Склад) Экспорт

	// Воспроизводим дефолты Инициализация() формы питЗагрузкаИзДанныхПродажФронта
	Обработка.ДатаЦелевыхДокументов      = 1;
	Обработка.ГруппироватьПоНомеруСмены  = Истина;
	Обработка.ПереходящаяСмена           = Истина;
	Обработка.ДнейВпередДляАнализаПерехода = 1;
	Обработка.ДнейНазадДляАнализаПерехода  = 1;

	// Ограничиваем отбор строго выбранным днём
	Обработка.ДатаНачалаОтбора = День;
	Обработка.ДатаКонцаОтбора  = День;

	// Заполняем ТЧ ПараметрыКасс только кассами выбранного склада
	ЗапросКасс = Новый Запрос;
	ЗапросКасс.Текст =
	"ВЫБРАТЬ
	|	КассыККМ.Ссылка КАК Касса
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.питКассовыйУзел.СкладПриготовления = &Склад";

	ЗапросКасс.УстановитьПараметр("Склад", Склад);

	ВыборкаКасс = ЗапросКасс.Выполнить().Выбрать();

	Пока ВыборкаКасс.Следующий() Цикл
		НоваяСтрока = Обработка.ПараметрыКасс.Добавить();
		НоваяСтрока.КассаККМ = ВыборкаКасс.Касса;
	КонецЦикла;

КонецПроцедуры

// Формирует таблицу отклонений между агрегатами по чекам и по проведённым
// документам питВыпускБлюд для выбранного дня и склада.
//
// Параметры:
//  День   - Дата
//  Склад  - СправочникСсылка.Склады
//
// Возвращаемое значение:
//  ТаблицаЗначений с колонками:
//   - Номенклатура, Характеристика, Склад,
//   - КоличествоПоЧекам, КоличествоПоВыпуску, Разница,
//   - Блокирует (Булево - Истина при Разница < 0)
//
Функция ПолучитьОтклоненияВыпуска(День, Склад) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("Склад");
	Результат.Колонки.Добавить("КоличествоПоЧекам", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("КоличествоПоВыпуску", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Разница", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Блокирует", Новый ОписаниеТипов("Булево"));

	НачалоДня = НачалоДня(День);
	КонецДня  = КонецДня(День);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыЧеков.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТоварыЧеков.Номенклатура.питПродажаПоСвободнойЦене
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ТоварыЧеков.Характеристика
	|	КОНЕЦ КАК Характеристика,
	|	ТоварыЧеков.Ссылка.Склад КАК Склад,
	|	СУММА(ТоварыЧеков.Количество) КАК КоличествоПоЧекам
	|ПОМЕСТИТЬ ОжидаетсяПоЧекам
	|ИЗ
	|	Документ.питДанныеПродажФронта.Товары КАК ТоварыЧеков
	|ГДЕ
	|	ТоварыЧеков.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И ТоварыЧеков.Ссылка.Склад = &Склад
	|	И НЕ ТоварыЧеков.Ссылка.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЧеков.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТоварыЧеков.Номенклатура.питПродажаПоСвободнойЦене
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ТоварыЧеков.Характеристика
	|	КОНЕЦ,
	|	ТоварыЧеков.Ссылка.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, Характеристика, Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВыпуска.Номенклатура КАК Номенклатура,
	|	ТоварыВыпуска.Характеристика КАК Характеристика,
	|	ТоварыВыпуска.Ссылка.Склад КАК Склад,
	|	СУММА(ТоварыВыпуска.Количество) КАК КоличествоПоВыпуску
	|ПОМЕСТИТЬ ФактПоВыпускам
	|ИЗ
	|	Документ.питВыпускБлюд.Товары КАК ТоварыВыпуска
	|ГДЕ
	|	ТоварыВыпуска.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И ТоварыВыпуска.Ссылка.Склад = &Склад
	|	И ТоварыВыпуска.Ссылка.Проведен
	|	И НЕ ТоварыВыпуска.Ссылка.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВыпуска.Номенклатура,
	|	ТоварыВыпуска.Характеристика,
	|	ТоварыВыпуска.Ссылка.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, Характеристика, Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОжидаетсяПоЧекам.Номенклатура, ФактПоВыпускам.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ОжидаетсяПоЧекам.Характеристика, ФактПоВыпускам.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ОжидаетсяПоЧекам.Склад, ФактПоВыпускам.Склад) КАК Склад,
	|	ЕСТЬNULL(ОжидаетсяПоЧекам.КоличествоПоЧекам, 0) КАК КоличествоПоЧекам,
	|	ЕСТЬNULL(ФактПоВыпускам.КоличествоПоВыпуску, 0) КАК КоличествоПоВыпуску,
	|	ЕСТЬNULL(ФактПоВыпускам.КоличествоПоВыпуску, 0) - ЕСТЬNULL(ОжидаетсяПоЧекам.КоличествоПоЧекам, 0) КАК Разница
	|ИЗ
	|	ОжидаетсяПоЧекам КАК ОжидаетсяПоЧекам
	|		ПОЛНОЕ СОЕДИНЕНИЕ ФактПоВыпускам КАК ФактПоВыпускам
	|		ПО ОжидаетсяПоЧекам.Номенклатура = ФактПоВыпускам.Номенклатура
	|		И ОжидаетсяПоЧекам.Характеристика = ФактПоВыпускам.Характеристика
	|		И ОжидаетсяПоЧекам.Склад = ФактПоВыпускам.Склад
	|ГДЕ
	|	ЕСТЬNULL(ФактПоВыпускам.КоличествоПоВыпуску, 0) - ЕСТЬNULL(ОжидаетсяПоЧекам.КоличествоПоЧекам, 0) <> 0";

	Запрос.УстановитьПараметр("НачалоДня", НачалоДня);
	Запрос.УстановитьПараметр("КонецДня",  КонецДня);
	Запрос.УстановитьПараметр("Склад",     Склад);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Номенклатура        = Выборка.Номенклатура;
		НоваяСтрока.Характеристика      = Выборка.Характеристика;
		НоваяСтрока.Склад               = Выборка.Склад;
		НоваяСтрока.КоличествоПоЧекам   = Выборка.КоличествоПоЧекам;
		НоваяСтрока.КоличествоПоВыпуску = Выборка.КоличествоПоВыпуску;
		НоваяСтрока.Разница             = Выборка.Разница;
		НоваяСтрока.Блокирует           = Выборка.Разница < 0;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Классифицирует сообщения об ошибках, полученные после формирования документов.
// Категории: нехватка марок/акта, нехватка ингредиентов,
// отрицательные остатки после выпуска, прочие.
//
// Параметры:
//  День   - Дата
//  Склад  - СправочникСсылка.Склады
//
// Возвращаемое значение:
//  ТаблицаЗначений с колонками: Категория, ТекстОшибки
//
Функция ПолучитьОшибкиФормирования(День, Склад) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Категория");
	Результат.Колонки.Добавить("ТекстОшибки");

	// Проверяем сформированные документы питВыпускБлюд за день/склад
	НачалоДня = НачалоДня(День);
	КонецДня  = КонецДня(День);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыпускБлюд.Ссылка КАК Документ
	|ИЗ
	|	Документ.питВыпускБлюд КАК ВыпускБлюд
	|ГДЕ
	|	ВыпускБлюд.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И ВыпускБлюд.Склад = &Склад
	|	И НЕ ВыпускБлюд.Проведен
	|	И НЕ ВыпускБлюд.ПометкаУдаления";

	Запрос.УстановитьПараметр("НачалоДня", НачалоДня);
	Запрос.УстановитьПараметр("КонецДня",  КонецДня);
	Запрос.УстановитьПараметр("Склад",     Склад);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		// Классифицируем ошибки по тексту (уточняется на реальных данных)
		// Для каждого непроведённого документа пытаемся определить причину
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Категория   = "Прочие";
		НоваяСтрока.ТекстОшибки = СтрШаблон("Документ %1 не проведён", Выборка.Документ);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает список документов питВыпускБлюд по «открытым ценам»
// (с заполненным ПЛ_Номенклатура), которые не проведены.
//
// Параметры:
//  День   - Дата
//  Склад  - СправочникСсылка.Склады
//
// Возвращаемое значение:
//  ТаблицаЗначений с колонками: Документ, НоменклатураОткрытойЦены
//
Функция ПолучитьДокументыОткрытыеЦены(День, Склад) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Документ");
	Результат.Колонки.Добавить("НоменклатураОткрытойЦены");

	НачалоДня = НачалоДня(День);
	КонецДня  = КонецДня(День);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыпускБлюд.Ссылка         КАК Документ,
	|	ВыпускБлюд.ПЛ_Номенклатура КАК НоменклатураОткрытойЦены
	|ИЗ
	|	Документ.питВыпускБлюд КАК ВыпускБлюд
	|ГДЕ
	|	ВыпускБлюд.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И ВыпускБлюд.Склад = &Склад
	|	И ВыпускБлюд.ПЛ_Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ ВыпускБлюд.Проведен
	|	И НЕ ВыпускБлюд.ПометкаУдаления";

	Запрос.УстановитьПараметр("НачалоДня", НачалоДня);
	Запрос.УстановитьПараметр("КонецДня",  КонецДня);
	Запрос.УстановитьПараметр("Склад",     Склад);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Документ                 = Выборка.Документ;
		НоваяСтрока.НоменклатураОткрытойЦены = Выборка.НоменклатураОткрытойЦены;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает строки отрицательных остатков по регистру ТоварыНаСкладах
// для выбранного дня и склада.
//
// Параметры:
//  День   - Дата
//  Склад  - СправочникСсылка.Склады
//
// Возвращаемое значение:
//  ТаблицаЗначений с колонками: Склад, Номенклатура, Характеристика, КонечныйОстаток
//
Функция ПолучитьОтрицательныеОстатки(День, Склад) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Склад");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("КонечныйОстаток", Новый ОписаниеТипов("Число"));

	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(Склад);

	КонецПериода = КонецДня(День);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстаткиИОбороты.Склад             КАК Склад,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура        КАК Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Характеристика      КАК Характеристика,
	|	ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	|		,
	|		&КонецПериода,
	|		Регистратор,
	|		,
	|		Склад В (&МассивСкладов)) КАК ТоварыНаСкладахОстаткиИОбороты
	|ГДЕ
	|	ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток < 0";

	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Склад          = Выборка.Склад;
		НоваяСтрока.Номенклатура   = Выборка.Номенклатура;
		НоваяСтрока.Характеристика = Выборка.Характеристика;
		НоваяСтрока.КонечныйОстаток = Выборка.КонечныйОстаток;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает строки параметров касс для указанной фронт-системы.
//
// Параметры:
//  ПараметрыКасс - ТаблицаЗначений, Неопределено - исходные параметры касс
//  ФронтСистема  - ПеречислениеСсылка.ПЛ_ТипыФронтСистем
//
// Возвращаемое значение:
//  ТаблицаЗначений - параметры касс выбранной фронт-системы
//
Функция ПараметрыКассДляФронтСистемы(ПараметрыКасс, ФронтСистема)

	Результат = НоваяТаблицаПараметровКасс();

	Если ПараметрыКасс = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого СтрокаПараметров Из ПараметрыКасс Цикл

		Если НЕ СтрокаПараметров.Использовать Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаПараметров.ФронтСистема <> ФронтСистема Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаПараметров.КодТочкиПродаж) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Использовать            = Истина;
		НоваяСтрока.КассаККМ                = СтрокаПараметров.КассаККМ;
		НоваяСтрока.ФронтСистема            = СтрокаПараметров.ФронтСистема;
		НоваяСтрока.КодТочкиПродаж          = СтрокаПараметров.КодТочкиПродаж;
		НоваяСтрока.НаименованиеТочкиПродаж = СтрокаПараметров.НаименованиеТочкиПродаж;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Создает таблицу параметров касс в формате обработки загрузки фронт-данных.
//
// Возвращаемое значение:
//  ТаблицаЗначений - параметры касс
//
Функция НоваяТаблицаПараметровКасс()

	ПараметрыКасс = Новый ТаблицаЗначений;
	ПараметрыКасс.Колонки.Добавить("Использовать", Новый ОписаниеТипов("Булево"));
	ПараметрыКасс.Колонки.Добавить("КассаККМ", Новый ОписаниеТипов("СправочникСсылка.КассыККМ"));
	ПараметрыКасс.Колонки.Добавить("ФронтСистема", Новый ОписаниеТипов("ПеречислениеСсылка.ПЛ_ТипыФронтСистем"));
	ПараметрыКасс.Колонки.Добавить("КодТочкиПродаж", Новый ОписаниеТипов("Строка"));
	ПараметрыКасс.Колонки.Добавить("НаименованиеТочкиПродаж", Новый ОписаниеТипов("Строка"));

	Возврат ПараметрыКасс;

КонецФункции

// Возвращает агрегированный статус формирования по складам.
//
// Параметры:
//  День          - Дата
//  МассивСкладов - Массив из СправочникСсылка.Склады
//  ПараметрыКасс - ТаблицаЗначений
//
// Возвращаемое значение:
//  Строка - «Пройден» / «НеПройден»
//
Функция ОбщийСтатусФормирования(День, МассивСкладов, ПараметрыКасс)

	Для Каждого Склад Из МассивСкладов Цикл

		Результат = СтатусШагаФормирование(День, Склад, ПараметрыКасс);
		Если Результат.Статус <> "Пройден" Тогда
			Возврат "Не Пройден";
		КонецЕсли;

	КонецЦикла;

	Возврат "Пройден";

КонецФункции

// Возвращает агрегированный статус остатков по складам.
//
// Параметры:
//  День          - Дата
//  МассивСкладов - Массив из СправочникСсылка.Склады
//
// Возвращаемое значение:
//  Строка - «Пройден» / «НеПройден»
//
Функция ОбщийСтатусОстатков(День, МассивСкладов)

	Для Каждого Склад Из МассивСкладов Цикл

		Результат = СтатусШагаОстатки(День, Склад);
		Если Результат.Статус <> "Пройден" Тогда
			Возврат "Не Пройден";
		КонецЕсли;

	КонецЦикла;

	Возврат "Пройден";

КонецФункции

// Обрабатывает строки результата сверки от одной фронт-системы:
// пропускает строки с незаполненным ЧекОбщепита (чеки, не загруженные в 1С),
// сравнивает суммы и скидки, добавляет отклонения в результирующую таблицу.
//
// Параметры:
//  Результат     - ТаблицаЗначений - результирующая таблица отклонений
//  ТаблицаДанных - ТаблицаЗначений - данные от ВыполнитьПолучениеДанныхTNG/Micros
//  ИмяСистемы    - Строка - «TNG» или «Micros»
//
Процедура ОбработатьСтрокиСверки(Результат, ТаблицаДанных, ИмяСистемы)

	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		// Пропускаем строки, где чек ещё не подгружен в 1С
		Если НЕ ЗначениеЗаполнено(СтрокаДанных.ЧекОбщепита) Тогда
			Продолжить;
		КонецЕсли;

		ОтклонениеСуммы  = 0;
		ОтклонениеСкидки = 0;

		// Сравниваем суммы (колонки могут отличаться в зависимости от фронт-системы)
		Если СтрокаДанных.Свойство("СУММАТОВАРА") Тогда
			СуммаФронта = СтрокаДанных.СУММАТОВАРА;
		Иначе
			СуммаФронта = 0;
		КонецЕсли;

		Если СтрокаДанных.Свойство("СуммаЧекОбщепита") Тогда
			Сумма1С = СтрокаДанных.СуммаЧекОбщепита;
		Иначе
			Сумма1С = 0;
		КонецЕсли;

		Если СуммаФронта <> Сумма1С Тогда
			ОтклонениеСуммы = Сумма1С - СуммаФронта;
		КонецЕсли;

		// Сравниваем скидки
		Если СтрокаДанных.Свойство("СУММАСКИДКИ") Тогда
			СкидкаФронта = СтрокаДанных.СУММАСКИДКИ;
		Иначе
			СкидкаФронта = 0;
		КонецЕсли;

		Если СтрокаДанных.Свойство("СуммаСкидкиЧекОбщепита") Тогда
			Скидка1С = СтрокаДанных.СуммаСкидкиЧекОбщепита;
		Иначе
			Скидка1С = 0;
		КонецЕсли;

		Если СкидкаФронта <> Скидка1С Тогда
			ОтклонениеСкидки = Скидка1С - СкидкаФронта;
		КонецЕсли;

		// Категория отклонения
		Категория = "";
		Если ОтклонениеСуммы <> 0 И ОтклонениеСкидки <> 0 Тогда
			Категория = "СуммаИСкидка";
		ИначеЕсли ОтклонениеСуммы <> 0 Тогда
			Категория = "Сумма";
		ИначеЕсли ОтклонениеСкидки <> 0 Тогда
			Категория = "Скидка";
		КонецЕсли;

		// Проверка на алкоголь и марки
		Если Категория <> "" Тогда
			Если СтрокаДанных.Свойство("АлкогольнаяПродукция")
				И СтрокаДанных.АлкогольнаяПродукция Тогда
				Попытка
					Марка = MRS_ЗагрузкаЕГАИСФронт.ПолучитьАкцизнуюМаркуПоНомеруЧека(СтрокаДанных.НомерЧека);
					Если НЕ ЗначениеЗаполнено(Марка) Тогда
						Категория = "Алкоголь Марка";
					КонецЕсли;
				Исключение
					Категория = "Алкоголь Марка";
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;

		Если Категория <> "" Тогда
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.ФронтСистема    = ИмяСистемы;
			Если СтрокаДанных.Свойство("НомерЧека") Тогда
				НоваяСтрока.НомерЧека = СтрокаДанных.НомерЧека;
			Иначе
				НоваяСтрока.НомерЧека = "";
			КонецЕсли;

			Если СтрокаДанных.Свойство("КодТочкиПродаж") Тогда
				НоваяСтрока.КодТочкиПродаж = СтрокаДанных.КодТочкиПродаж;
			Иначе
				НоваяСтрока.КодТочкиПродаж = "";
			КонецЕсли;

			Если СтрокаДанных.Свойство("Номенклатура") Тогда
				НоваяСтрока.Номенклатура = СтрокаДанных.Номенклатура;
			Иначе
				НоваяСтрока.Номенклатура = Неопределено;
			КонецЕсли;
			НоваяСтрока.СуммаПоФронту   = СуммаФронта;
			НоваяСтрока.СуммаПоЧеку1С   = Сумма1С;
			НоваяСтрока.ОтклонениеСуммы = ОтклонениеСуммы;
			НоваяСтрока.СкидкаПоФронту  = СкидкаФронта;
			НоваяСтрока.СкидкаПоЧеку1С  = Скидка1С;
			НоваяСтрока.ОтклонениеСкидки = ОтклонениеСкидки;
			НоваяСтрока.КатегорияОтклонения = Категория;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
